## Connect to the local database where Pagila is loaded

In [1]:
%load_ext sql

In [7]:
import os
from dotenv import load_dotenv

# loading variables from .env file
load_dotenv() 

# postgresql://username:password@host:port/database
conn_string = "postgresql://{}:{}@{}:{}/{}" \
                        .format(os.getenv('DB_USER'), os.getenv('DB_PASSWORD'), os.getenv('DB_ENDPOINT'), os.getenv('DB_PORT'), os.getenv('DB'))

print(conn_string)

postgresql://postgres:dinhlang@127.0.0.1:5432/data_warehouse_db

In [8]:
%sql $conn_string

## Explore the 3NF Schema

<img src="../images/pagila-3nf.png"  width="70%">

### 1. Explore the data sizes?

In [5]:
store_len = %sql select count(*) from store;
film_len = %sql select count(*) from film;
customer_len = %sql select count(*) from customer;
rental_len = %sql select count(*) from rental;
payment_len = %sql select count(*) from payment;
staff_len = %sql select count(*) from staff;
city_len = %sql select count(*) from city;
country_len = %sql select count(*) from country;

print("store: ", store_len[0][0])
print("film: ", film_len[0][0])
print("customer: ", customer_len[0][0])
print("rental: ", rental_len[0][0])
print("payment: ", payment_len[0][0])
print("staff: ", staff_len[0][0])
print("city: ", city_len[0][0])
print("country: ", country_len[0][0])

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.
 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.
store:  2
film:  1000
customer:  599
rental:  16044
payment:  16049
staff:  2
city:  600
country:  109

### 2. What was the period time for the payment?

In [6]:
%%sql
select min(payment_date) as start_date, max(payment_date) as end_date from payment;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.

[(datetime.datetime(2022, 1, 23, 23, 33, 52, 212496, tzinfo=datetime.timezone(datetime.timedelta(seconds=37800))), datetime.datetime(2022, 7, 27, 20, 9, 20, 739759, tzinfo=datetime.timezone(datetime.timedelta(seconds=34200))))]

### 3. Where did the events occur?

In [8]:
%%sql
select district, count(address_id) as total_addresses
from address
group by district
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
10 rows affected.

[('Aden', 1),
 ('Eastern Visayas', 1),
 ('Vaduz', 1),
 ('Tokat', 1),
 ('Anzotegui', 1),
 ('Saint-Denis', 1),
 ('Chollanam', 1),
 ('Chihuahua', 2),
 ('Nyanza', 1),
 ('Changhwa', 1)]

## Perform some simple data analysis

### 1. Top Grossing Movies

In [9]:
%%sql
select f.title, sum(p.amount) as total_revenue
from payment p
join rental r
on p.rental_id = r.rental_id
join inventory i
on i.inventory_id = r.inventory_id
join film f
on f.film_id = i.film_id
group by f.title
order by total_revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
10 rows affected.

[('TELEGRAPH VOYAGE', Decimal('231.73')),
 ('WIFE TURN', Decimal('223.69')),
 ('ZORRO ARK', Decimal('214.69')),
 ('GOODFELLAS SALUTE', Decimal('209.69')),
 ('SATURDAY LAMBS', Decimal('204.72')),
 ('TITANS JERK', Decimal('201.71')),
 ('TORQUE BOUND', Decimal('198.72')),
 ('HARRY IDAHO', Decimal('195.70')),
 ('INNOCENT USUAL', Decimal('191.74')),
 ('HUSTLER PARTY', Decimal('190.78'))]

### 2. Top Grossing Cities

In [13]:
%%sql
select ci.city, sum(p.amount) as total_revenue
from payment p
join customer c
on p.customer_id = c.customer_id
join address a
on c.address_id = a.address_id
join city ci
on ci.city_id = a.city_id
group by ci.city
order by total_revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
10 rows affected.

[('Cape Coral', Decimal('221.55')),
 ('Saint-Denis', Decimal('216.54')),
 ('Aurora', Decimal('198.50')),
 ('Molodetno', Decimal('195.58')),
 ('Santa Brbara dOeste', Decimal('194.61')),
 ('Apeldoorn', Decimal('194.61')),
 ('Qomsheh', Decimal('186.62')),
 ('London', Decimal('180.52')),
 ('Ourense (Orense)', Decimal('177.60')),
 ('Bijapur', Decimal('175.61'))]

### 3. Revenue of a movie  by customer city and by month

In [23]:
%%sql
select f.title, ci.city, extract(month from p.payment_date) as month, sum(p.amount) as total_revenue
from payment p
join rental r
on p.rental_id = r.rental_id
join inventory i
on i.inventory_id = r.inventory_id
join film f
on f.film_id = i.film_id
join customer cu
on cu.customer_id = p.customer_id
join address a
on a.address_id = cu.address_id
join city ci
on ci.city_id = a.city_id
group by f.title, ci.city, extract(month from p.payment_date)
order by month asc, total_revenue desc
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
10 rows affected.

[('WONDERLAND CHRISTMAS', 'Hodeida', Decimal('1'), Decimal('10.99')),
 ('PATHS CONTROL', 'Yamuna Nagar', Decimal('1'), Decimal('10.99')),
 ('BRIGHT ENCOUNTERS', 'Allende', Decimal('1'), Decimal('10.99')),
 ('FLINTSTONES HAPPINESS', 'Baku', Decimal('1'), Decimal('10.99')),
 ('MAIDEN HOME', 'Purnea (Purnia)', Decimal('1'), Decimal('10.99')),
 ('DESERT POSEIDON', 'Sawhaj', Decimal('1'), Decimal('9.99')),
 ('GOODFELLAS SALUTE', 'Talavera', Decimal('1'), Decimal('9.99')),
 ('ELEPHANT TROJAN', 'al-Hawiya', Decimal('1'), Decimal('9.99')),
 ('FLINTSTONES HAPPINESS', 'Kolpino', Decimal('1'), Decimal('9.99')),
 ('HALL CASSIDY', 'Bag', Decimal('1'), Decimal('9.99'))]

## Create Facts and Dimensions

<img src="../images/pagila-star.png">

### 1. Create dimdate dimension table

In [24]:
%%sql
CREATE TABLE dimdate
(
    date_key SERIAL PRIMARY KEY,
    date date NOT NULL,
    year smallint NOT NULL,
    quarter smallint NOT NULL,
    month smallint NOT NULL,
    day smallint NOT NULL,
    week smallint NOT NULL,
    is_weekend boolean NOT NULL
);

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
Done.

[]

### Check the dimdate table existed in the database

In [31]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name = 'dimdate';

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
8 rows affected.

[('date_key', 'integer'),
 ('date', 'date'),
 ('year', 'smallint'),
 ('quarter', 'smallint'),
 ('month', 'smallint'),
 ('day', 'smallint'),
 ('week', 'smallint'),
 ('is_weekend', 'boolean')]

### 2. Create dimcustomer dimension table

In [32]:
%%sql
CREATE TABLE IF NOT EXISTS dimcustomer
(
    customer_key SERIAL PRIMARY KEY,
    customer_id smallint NOT NULL,
    first_name varchar(45) NOT NULL,
    last_name varchar(45) NOT NULL,
    email varchar(50),
    address varchar(50) NOT NULL,
    address2 varchar(50),
    district varchar(20) NOT NULL,
    city varchar(50) NOT NULL,
    country varchar(50) NOT NULL,
    postal_code varchar(10),
    phone varchar(20) NOT NULL,
    active smallint NOT NULL,
    create_date timestamp NOT NULL,
    start_date date NOT NULL,
    end_date date NOT NULL
);

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
Done.

[]

### 3. Create dimmovie dimension table

In [34]:
%%sql
CREATE TABLE IF NOT EXISTS dimmovie
(
    movie_key SERIAL PRIMARY KEY,
    film_id smallint NOT NULL,
    title varchar(255) NOT NULL,
    description text,
    release_year year,
    language varchar(20) NOT NULL,
    original_language varchar(20),
    rental_duration smallint NOT NULL,
    length smallint NOT NULL,
    rating varchar(5) NOT NULL,
    special_features varchar(60) NOT NULL
);

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
Done.

[]

### 3. Create dimstore dimension table

In [35]:
%%sql
CREATE TABLE IF NOT EXISTS dimstore
(
    store_key SERIAL PRIMARY KEY,
    store_id smallint NOT NULL,
    address varchar(50) NOT NULL,
    address2 varchar(50),
    district varchar(20) NOT NULL,
    city varchar(50) NOT NULL,
    country varchar(50) NOT NULL,
    postal_code varchar(10),
    manager_first_name varchar(45) NOT NULL,
    manager_last_name varchar(45) NOT NULL,
    start_date date NOT NULL,
    end_date date NOT NULL
);

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
Done.

[]

### 4. Create the factsales table

In [40]:
%%sql
CREATE TABLE IF NOT EXISTS factSales
(
    sales_key SERIAL PRIMARY KEY,
    date_key integer NOT NULL REFERENCES dimdate(date_key),
    customer_key integer NOT NULL REFERENCES dimcustomer(customer_key),
    movie_key integer NOT NULL REFERENCES dimmovie(movie_key),
    store_key integer NOT NULL REFERENCES dimstore(store_key),
    sales_amount numeric NOT NULL
);

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
Done.

[]

### Check the factsales table existed in the database

In [41]:
%%sql
SELECT column_name, data_type
FROM information_schema.columns
WHERE table_name = 'factsales';

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
6 rows affected.

[('sales_key', 'integer'),
 ('date_key', 'integer'),
 ('customer_key', 'integer'),
 ('movie_key', 'integer'),
 ('store_key', 'integer'),
 ('sales_amount', 'numeric')]

## ETL from 3NF to Star Schema

### Extract data from the normalized database, transform it, and load it into the new tables.

### 1. Insert data into the dimdate table

In [43]:
%%sql
INSERT INTO dimdate (date_key, date, year, quarter, month, day, week, is_weekend)
SELECT DISTINCT(TO_CHAR(payment_date, 'yyyymmdd')::integer) AS date_key,
         date(payment_date) AS date,
         EXTRACT(year FROM payment_date) AS year,
         EXTRACT(quarter FROM payment_date) AS quarter,
         EXTRACT(month FROM payment_date) AS month,
         EXTRACT(day FROM payment_date) AS day,
         EXTRACT(week FROM payment_date) AS week,
         CASE WHEN EXTRACT(ISODOW FROM payment_date) IN (6, 7) THEN TRUE ELSE FALSE END AS is_weekend
FROM payment

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
186 rows affected.

[]

### 2. Insert data into the dimcustomer table

In [48]:
%%sql
INSERT INTO dimcustomer (customer_key, customer_id, first_name, last_name, email, address, address2, district, city, country, postal_code, phone, active, create_date, start_date, end_date)
SELECT cu.customer_id AS customer_key,
    cu.customer_id,
    cu.first_name,
    cu.last_name,
    cu.email,
    a.address,
    a.address2,
    a.district,
    ci.city,
    co.country,
    a.postal_code,
    a.phone,
    cu.active,
    cu.create_date,
    now() AS start_date,
    now() AS end_date
FROM customer cu
JOIN address a ON cu.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN country co ON ci.country_id = co.country_id

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
599 rows affected.

[]

### 3. Insert data into the dimmovie table

In [49]:
%%sql
INSERT INTO dimmovie (movie_key, film_id, title, description, release_year, language, original_language, rental_duration, length, rating, special_features)
SELECT f.film_id AS movie_key,
    f.film_id,
    f.title,
    f.description,
    f.release_year,
    l.name AS language,
    orig_lang.name AS original_language,
    f.rental_duration,
    f.length,
    f.rating,
    f.special_features
FROM film f
JOIN language l ON f.language_id = l.language_id
LEFT JOIN language orig_lang ON f.original_language_id = orig_lang.language_id

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1000 rows affected.

[]

### 4. Insert data into the dimstore table

In [50]:
%%sql
INSERT INTO dimstore (store_key, store_id, address, address2, district, city, country, postal_code, manager_first_name, manager_last_name, start_date, end_date)
SELECT s.store_id AS store_key,
    s.store_id,
    a.address,
    a.address2,
    a.district,
    ci.city,
    co.country,
    a.postal_code,
    st.first_name AS manager_first_name,
    st.last_name AS manager_last_name,
    now() AS start_date,
    now() AS end_date
FROM store s
JOIN address a ON s.address_id = a.address_id
JOIN city ci ON a.city_id = ci.city_id
JOIN country co ON ci.country_id = co.country_id
JOIN staff st ON s.manager_staff_id = st.staff_id

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
2 rows affected.

[]

### 5. Insert data into the factsales table

In [53]:
%%sql
INSERT INTO factSales (date_key, customer_key, movie_key, store_key, sales_amount)
SELECT
    TO_CHAR(payment_date, 'yyyymmdd')::integer AS date_key,
    p.customer_id AS customer_key,
    i.film_id AS movie_key,
    i.store_id AS store_key,
    p.amount AS sales_amount
FROM payment p
JOIN rental r ON p.rental_id = r.rental_id
JOIN inventory i ON r.inventory_id = i.inventory_id

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
16049 rows affected.

[]

### Check data in the factsales table

In [54]:
%%sql
SELECT movie_key, date_key, store_key, customer_key, sales_amount
FROM factSales
limit 10;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
10 rows affected.

[(651, 20220129, 1, 269, Decimal('0.99')),
 (138, 20220125, 1, 274, Decimal('2.99')),
 (186, 20220128, 1, 297, Decimal('0.99')),
 (197, 20220131, 1, 344, Decimal('2.99')),
 (741, 20220127, 2, 348, Decimal('0.99')),
 (315, 20220124, 2, 357, Decimal('0.99')),
 (979, 20220131, 2, 369, Decimal('4.99')),
 (900, 20220129, 1, 372, Decimal('2.99')),
 (563, 20220129, 1, 373, Decimal('4.99')),
 (159, 20220131, 2, 379, Decimal('4.99'))]

### Check the time of running Star Schema and 3NF

#### 1.1 Star Schema

In [55]:
%%time
%%sql
SELECT dimMovie.title, dimDate.month, dimCustomer.city, sum(sales_amount) as revenue
FROM factSales 
JOIN dimMovie    on (dimMovie.movie_key      = factSales.movie_key)
JOIN dimDate     on (dimDate.date_key         = factSales.date_key)
JOIN dimCustomer on (dimCustomer.customer_key = factSales.customer_key)
group by (dimMovie.title, dimDate.month, dimCustomer.city)
order by dimMovie.title, dimDate.month, dimCustomer.city, revenue desc;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
16017 rows affected.
CPU times: user 24.3 ms, sys: 6.77 ms, total: 31 ms
Wall time: 74.2 ms

#### 1.2 3NF

In [56]:
%%time
%%sql
SELECT f.title, EXTRACT(month FROM p.payment_date) as month, ci.city, sum(p.amount) as revenue
FROM payment p
JOIN rental r    ON ( p.rental_id = r.rental_id )
JOIN inventory i ON ( r.inventory_id = i.inventory_id )
JOIN film f ON ( i.film_id = f.film_id)
JOIN customer c  ON ( p.customer_id = c.customer_id )
JOIN address a ON ( c.address_id = a.address_id )
JOIN city ci ON ( a.city_id = ci.city_id )
group by (f.title, month, ci.city)
order by f.title, month, ci.city, revenue desc;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
16017 rows affected.
CPU times: user 26.8 ms, sys: 6.36 ms, total: 33.1 ms
Wall time: 96.5 ms

## OLAP Cubes

### 1. Create a simple cube.
A query that calculates the revenue (sales_amount) by day, rating, and city of customers renting the movies. Remember to join with the appropriate dimension tables to replace the keys with the dimension labels. Sort by revenue in descending order and limit to the first 20 rows.

In [10]:
%%sql
SELECT dd.day, dm.rating, dc.city, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimcustomer dc ON f.customer_key = dc.customer_key
JOIN dimmovie dm ON f.movie_key = dm.movie_key
GROUP BY (dd.day, dm.rating, dc.city)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
20 rows affected.

[(24, 'G', 'Goinia', Decimal('20.97')),
 (13, 'G', 'Songkhla', Decimal('19.98')),
 (4, 'NC-17', 'Lapu-Lapu', Decimal('19.97')),
 (14, 'G', 'Qomsheh', Decimal('18.98')),
 (16, 'PG-13', 'Kamyin', Decimal('18.97')),
 (27, 'NC-17', 'Sincelejo', Decimal('18.97')),
 (5, 'NC-17', 'Ourense (Orense)', Decimal('17.98')),
 (8, 'G', 'San Bernardino', Decimal('17.98')),
 (23, 'R', 'Sharja', Decimal('17.98')),
 (9, 'PG-13', 'Angra dos Reis', Decimal('17.98')),
 (22, 'PG', 'Moscow', Decimal('17.98')),
 (30, 'PG-13', 'Jastrzebie-Zdrj', Decimal('17.98')),
 (25, 'PG', 'Talavera', Decimal('17.98')),
 (6, 'PG', 'Mogiljov', Decimal('17.97')),
 (8, 'R', 'Naju', Decimal('17.97')),
 (24, 'G', 'London', Decimal('17.97')),
 (16, 'PG-13', 'Cuauhtmoc', Decimal('16.98')),
 (17, 'NC-17', 'Funafuti', Decimal('16.98')),
 (13, 'G', 'Touliu', Decimal('16.98')),
 (16, 'PG-13', 'Udaipur', Decimal('16.98'))]

### 2. Slicing: Reducing N dimensions to N-1 dimensions by restricting one dimension to a single value.
#### In the query above, we have a 3-dimensional cube on day, rating and city

A query that reduces the dimensionality of the above example by limiting the results to only include movies with a rating of "PG-13". Again, sort by revenue in descending order and limit to the first 20 rows.

In [11]:
%%sql
SELECT dd.day, dm.rating, dc.city, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimcustomer dc ON f.customer_key = dc.customer_key
JOIN dimmovie dm ON f.movie_key = dm.movie_key
WHERE dm.rating = 'PG-13'
GROUP BY (dd.day, dm.rating, dc.city)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
20 rows affected.

[(16, 'PG-13', 'Kamyin', Decimal('18.97')),
 (9, 'PG-13', 'Angra dos Reis', Decimal('17.98')),
 (30, 'PG-13', 'Jastrzebie-Zdrj', Decimal('17.98')),
 (1, 'PG-13', 's-Hertogenbosch', Decimal('16.98')),
 (16, 'PG-13', 'Cuauhtmoc', Decimal('16.98')),
 (16, 'PG-13', 'Udaipur', Decimal('16.98')),
 (5, 'PG-13', 'Huejutla de Reyes', Decimal('15.98')),
 (26, 'PG-13', 'Yantai', Decimal('15.98')),
 (25, 'PG-13', 'Alessandria', Decimal('15.98')),
 (10, 'PG-13', 'Greensboro', Decimal('15.98')),
 (27, 'PG-13', 'Iwaki', Decimal('15.97')),
 (15, 'PG-13', 'Brockton', Decimal('14.98')),
 (27, 'PG-13', 'Nyeri', Decimal('14.98')),
 (3, 'PG-13', 'Ashdod', Decimal('14.98')),
 (6, 'PG-13', 'Memphis', Decimal('14.98')),
 (6, 'PG-13', 'Ife', Decimal('14.98')),
 (26, 'PG-13', 'Najafabad', Decimal('14.97')),
 (15, 'PG-13', 'Jhansi', Decimal('14.97')),
 (29, 'PG-13', 'Kirovo-Tepetsk', Decimal('14.97')),
 (24, 'PG-13', 'Sivas', Decimal('14.97'))]

### 3. Dicing: creating a subcube with the same dimensionality but fewer values for two or more dimensions.
A query to create a subcube of the initial cube that includes moves with:

- ratings of PG or PG-13
- in the city of Bellevue or Lancaster
- day equal to 1, 15, or 30

In [9]:
%%sql
SELECT dd.day, dm.rating, dc.city, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimcustomer dc ON f.customer_key = dc.customer_key
JOIN dimmovie dm ON f.movie_key = dm.movie_key
WHERE dm.rating IN ('PG', 'PG-13')
    AND dc.city IN ('Bellevue', 'Lancaster')
    AND dd.day IN (1, 15, 30)
GROUP BY (dd.day, dm.rating, dc.city)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
2 rows affected.

[(15, 'PG-13', 'Lancaster', Decimal('8.99')),
 (1, 'PG', 'Lancaster', Decimal('6.99'))]

### 4. Roll Up: stepping up the level of aggregation to a large grouping

A query that calculates revenue (sales_amount) by day, rating, and country. Sort the data by revenue in descending order, and limit the data to the top 20 results.

In [10]:
%%sql
SELECT dd.day, dm.rating, dc.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimcustomer dc ON f.customer_key = dc.customer_key
JOIN dimmovie dm ON f.movie_key = dm.movie_key
GROUP BY (dd.day, dm.rating, dc.country)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
20 rows affected.

[(25, 'PG-13', 'India', Decimal('89.83')),
 (16, 'NC-17', 'China', Decimal('85.83')),
 (28, 'PG-13', 'China', Decimal('80.81')),
 (27, 'PG', 'India', Decimal('76.84')),
 (14, 'PG-13', 'China', Decimal('76.83')),
 (18, 'PG-13', 'China', Decimal('76.82')),
 (9, 'PG-13', 'India', Decimal('75.86')),
 (15, 'NC-17', 'India', Decimal('74.84')),
 (17, 'PG-13', 'India', Decimal('71.84')),
 (18, 'NC-17', 'China', Decimal('69.85')),
 (27, 'PG-13', 'China', Decimal('69.81')),
 (8, 'PG-13', 'India', Decimal('68.88')),
 (28, 'R', 'India', Decimal('68.85')),
 (13, 'NC-17', 'India', Decimal('68.83')),
 (1, 'PG-13', 'India', Decimal('67.88')),
 (6, 'G', 'India', Decimal('67.87')),
 (12, 'NC-17', 'India', Decimal('67.83')),
 (30, 'PG', 'India', Decimal('67.82')),
 (14, 'R', 'India', Decimal('66.90')),
 (1, 'R', 'India', Decimal('66.84'))]

### 5. Drill Down: breaking up one of dimensions to a lower level

A query that calculates revenue (sales_amount) by day, rating, and district. Sort the data by revenue in descending order, and limit the data to the top 20 results.

In [11]:
%%sql
SELECT dd.day, dm.rating, dc.district, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimcustomer dc ON f.customer_key = dc.customer_key
JOIN dimmovie dm ON f.movie_key = dm.movie_key
GROUP BY (dd.day, dm.rating, dc.district)
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
20 rows affected.

[(19, 'G', 'Shandong', Decimal('31.95')),
 (9, 'PG-13', 'Buenos Aires', Decimal('30.96')),
 (24, 'G', 'England', Decimal('30.95')),
 (3, 'R', 'West Bengali', Decimal('30.95')),
 (16, 'NC-17', 'Shandong', Decimal('29.94')),
 (26, 'G', 'California', Decimal('27.95')),
 (27, 'NC-17', 'Buenos Aires', Decimal('27.92')),
 (1, 'PG-13', 'West Bengali', Decimal('26.96')),
 (30, 'PG-13', 'Buenos Aires', Decimal('26.96')),
 (18, 'PG-13', 'Shandong', Decimal('26.95')),
 (18, 'NC-17', 'Buenos Aires', Decimal('26.93')),
 (26, 'PG-13', 'Shandong', Decimal('25.96')),
 (13, 'R', 'Buenos Aires', Decimal('25.95')),
 (12, 'NC-17', 'Buenos Aires', Decimal('25.92')),
 (6, 'NC-17', 'Maharashtra', Decimal('24.97')),
 (26, 'NC-17', 'West Bengali', Decimal('24.97')),
 (11, 'PG', 'Uttar Pradesh', Decimal('24.97')),
 (19, 'PG-13', 'West Bengali', Decimal('24.96')),
 (27, 'PG-13', 'California', Decimal('24.95')),
 (14, 'PG-13', 'West Bengali', Decimal('24.95'))]

### 6. Grouping Sets

##### It happens often that for 3 dimensions, when you want to aggregate a fact:

- by nothing (total)
- then by the 1st dimension
- then by the 2nd
- then by the 3rd
- then by the 1st and 2nd
- then by the 2nd and 3rd
- then by the 1st and 3rd
- then by the 1st and 2nd and 3rd
##### Since this is very common, and in all cases, we are iterating through all the fact table anyhow, there is a more clever way to do that using the SQL grouping statement "GROUPING SETS"

#### 6.1 Total Revenue:
A query that calculates total revenue (sales_amount)

In [12]:
%%sql
SELECT sum(f.sales_amount) as revenue
FROM factsales f;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
1 rows affected.

[(Decimal('67416.51'),)]

#### 6.2 Revenue by Country the movies stored
A query that calculates total revenue (sales_amount) by country

In [20]:
%%sql
SELECT ds.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimstore ds ON f.store_key = ds.store_key
GROUP BY ds.country
ORDER BY ds.country, revenue DESC
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
2 rows affected.

[('Australia', Decimal('33726.77')), ('Canada', Decimal('33689.74'))]

#### 6.3 Revenue by Month
A query that calculates total revenue (sales_amount) by month

In [15]:
%%sql
SELECT dd.month, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
GROUP BY dd.month
ORDER BY revenue DESC
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
7 rows affected.

[(3, Decimal('11364.99')),
 (5, Decimal('11362.25')),
 (6, Decimal('10896.48')),
 (4, Decimal('10798.39')),
 (2, Decimal('10157.03')),
 (7, Decimal('9869.29')),
 (1, Decimal('2968.08'))]

#### 6.4 Revenue by Month and Country
A query that calculates total revenue (sales_amount) by month and country. Sort the data by month, country in ascending order.

In [22]:
%%sql
SELECT dd.month , ds.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimstore ds ON f.store_key = ds.store_key
GROUP BY dd.month, ds.country
ORDER BY dd.month, ds.country
LIMIT 20;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
14 rows affected.

[(1, 'Australia', Decimal('1408.71')),
 (1, 'Canada', Decimal('1559.37')),
 (2, 'Australia', Decimal('5051.95')),
 (2, 'Canada', Decimal('5105.08')),
 (3, 'Australia', Decimal('5914.88')),
 (3, 'Canada', Decimal('5450.11')),
 (4, 'Australia', Decimal('5498.91')),
 (4, 'Canada', Decimal('5299.48')),
 (5, 'Australia', Decimal('5620.69')),
 (5, 'Canada', Decimal('5741.56')),
 (6, 'Australia', Decimal('5377.46')),
 (6, 'Canada', Decimal('5519.02')),
 (7, 'Australia', Decimal('4854.17')),
 (7, 'Canada', Decimal('5015.12'))]

#### 6.5 Total Revenue, by Month, by Country, by Month and Country in one shot
A query that calculates total revenue at the various grouping levels done above (total, by month, by country, by month & country) all at once using the grouping sets function.

In [24]:
%%sql
SELECT dd.month , ds.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimstore ds ON f.store_key = ds.store_key
GROUP BY GROUPING SETS ((), dd.month, ds.country, (dd.month, ds.country))
ORDER BY dd.month, ds.country;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
24 rows affected.

[(1, 'Australia', Decimal('1408.71')),
 (1, 'Canada', Decimal('1559.37')),
 (1, None, Decimal('2968.08')),
 (2, 'Australia', Decimal('5051.95')),
 (2, 'Canada', Decimal('5105.08')),
 (2, None, Decimal('10157.03')),
 (3, 'Australia', Decimal('5914.88')),
 (3, 'Canada', Decimal('5450.11')),
 (3, None, Decimal('11364.99')),
 (4, 'Australia', Decimal('5498.91')),
 (4, 'Canada', Decimal('5299.48')),
 (4, None, Decimal('10798.39')),
 (5, 'Australia', Decimal('5620.69')),
 (5, 'Canada', Decimal('5741.56')),
 (5, None, Decimal('11362.25')),
 (6, 'Australia', Decimal('5377.46')),
 (6, 'Canada', Decimal('5519.02')),
 (6, None, Decimal('10896.48')),
 (7, 'Australia', Decimal('4854.17')),
 (7, 'Canada', Decimal('5015.12')),
 (7, None, Decimal('9869.29')),
 (None, 'Australia', Decimal('33726.77')),
 (None, 'Canada', Decimal('33689.74')),
 (None, None, Decimal('67416.51'))]

### 7. CUBE
- Group by CUBE (dim1, dim2, ..) , produces all combinations of different lengths in one query.
- This view could be materialised in a view and queried which would save lots repetitive aggregations

#### 7.1 Using CUBE in the query
A query that calculates the various levels of aggregation done in the grouping sets exercise (total, by month, by country, by month & country) using the CUBE function.

In [32]:
%%sql
SELECT dd.month , ds.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimstore ds ON f.store_key = ds.store_key
GROUP BY CUBE (dd.month, ds.country)
ORDER BY dd.month, ds.country;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
24 rows affected.

[(1, 'Australia', Decimal('1408.71')),
 (1, 'Canada', Decimal('1559.37')),
 (1, None, Decimal('2968.08')),
 (2, 'Australia', Decimal('5051.95')),
 (2, 'Canada', Decimal('5105.08')),
 (2, None, Decimal('10157.03')),
 (3, 'Australia', Decimal('5914.88')),
 (3, 'Canada', Decimal('5450.11')),
 (3, None, Decimal('11364.99')),
 (4, 'Australia', Decimal('5498.91')),
 (4, 'Canada', Decimal('5299.48')),
 (4, None, Decimal('10798.39')),
 (5, 'Australia', Decimal('5620.69')),
 (5, 'Canada', Decimal('5741.56')),
 (5, None, Decimal('11362.25')),
 (6, 'Australia', Decimal('5377.46')),
 (6, 'Canada', Decimal('5519.02')),
 (6, None, Decimal('10896.48')),
 (7, 'Australia', Decimal('4854.17')),
 (7, 'Canada', Decimal('5015.12')),
 (7, None, Decimal('9869.29')),
 (None, 'Australia', Decimal('33726.77')),
 (None, 'Canada', Decimal('33689.74')),
 (None, None, Decimal('67416.51'))]

The execution time for the CUBE query:

In [43]:
%%time
%%sql
SELECT dd.month , ds.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimstore ds ON f.store_key = ds.store_key
GROUP BY CUBE (dd.month, ds.country)
ORDER BY dd.month, ds.country;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
24 rows affected.
CPU times: user 5.08 ms, sys: 2.24 ms, total: 7.32 ms
Wall time: 25.6 ms

#### 7.2 Using the normal way in the query

A query that calculates the various levels of aggregation done in the grouping sets exercise (total, by month, by country, by month & country) using the UNION ALL.

In [44]:
%%sql
SELECT NULL as month, NULL as country, sum(f.sales_amount) as revenue
FROM factsales f
UNION ALL
SELECT NULL as month, ds.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimstore ds ON f.store_key = ds.store_key
GROUP BY ds.country
UNION ALL
SELECT cast(dd.month as text), NULL as country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
GROUP BY dd.month
UNION ALL
SELECT cast(dd.month as text), ds.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimstore ds ON f.store_key = ds.store_key
GROUP BY dd.month, ds.country;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
24 rows affected.

[(None, None, Decimal('67416.51')),
 (None, 'Canada', Decimal('33689.74')),
 (None, 'Australia', Decimal('33726.77')),
 ('7', None, Decimal('9869.29')),
 ('1', None, Decimal('2968.08')),
 ('5', None, Decimal('11362.25')),
 ('4', None, Decimal('10798.39')),
 ('2', None, Decimal('10157.03')),
 ('6', None, Decimal('10896.48')),
 ('3', None, Decimal('11364.99')),
 ('5', 'Canada', Decimal('5741.56')),
 ('7', 'Australia', Decimal('4854.17')),
 ('3', 'Canada', Decimal('5450.11')),
 ('2', 'Australia', Decimal('5051.95')),
 ('5', 'Australia', Decimal('5620.69')),
 ('2', 'Canada', Decimal('5105.08')),
 ('1', 'Australia', Decimal('1408.71')),
 ('4', 'Australia', Decimal('5498.91')),
 ('3', 'Australia', Decimal('5914.88')),
 ('4', 'Canada', Decimal('5299.48')),
 ('1', 'Canada', Decimal('1559.37')),
 ('7', 'Canada', Decimal('5015.12')),
 ('6', 'Australia', Decimal('5377.46')),
 ('6', 'Canada', Decimal('5519.02'))]

The execution time for the UNION query:

In [45]:
%%time
%%sql
SELECT NULL as month, NULL as country, sum(f.sales_amount) as revenue
FROM factsales f
UNION ALL
SELECT NULL as month, ds.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimstore ds ON f.store_key = ds.store_key
GROUP BY ds.country
UNION ALL
SELECT cast(dd.month as text), NULL as country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
GROUP BY dd.month
UNION ALL
SELECT cast(dd.month as text), ds.country, sum(f.sales_amount) as revenue
FROM factsales f
JOIN dimdate dd ON f.date_key = dd.date_key
JOIN dimstore ds ON f.store_key = ds.store_key
GROUP BY dd.month, ds.country;

 * postgresql://postgres:***@127.0.0.1:5432/data_warehouse_db
24 rows affected.
CPU times: user 6.78 ms, sys: 2.06 ms, total: 8.85 ms
Wall time: 34.4 ms

### When executing the standard query using UNION and comparing its execution time with that of the cube query, we notice that grouping sets and cubes create queries that are more concise, readable, and efficient.